; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l11_p11_c11_g11_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(crate-content crate1 food)
	(crate-content crate2 medicine)
	(crate-content crate3 medicine)
	(crate-content crate4 medicine)
	(crate-content crate5 medicine)
	(crate-content crate6 medicine)
	(crate-content crate7 medicine)
	(crate-content crate8 medicine)
	(crate-content crate9 medicine)
	(crate-content crate10 medicine)
	(crate-content crate11 medicine)
	(at person1 loc7)
	(at person2 loc4)
	(at person3 loc6)
	(at person4 loc7)
	(at person5 loc10)
	(at person6 loc9)
	(at person7 loc1)
	(at person8 loc5)
	(at person9 loc2)
	(at person10 loc8)
	(at person11 loc10)
	(person-needs person1 medicine)
	(person-needs person3 medicine)
	(person-needs person4 medicine)
	(person-needs person5 medicine)
	(person-needs person6 medicine)
	(person-needs person7 food)
	(person-needs person7 medicine)
	(person-needs person8 medicine)
	(person-needs person9 medicine)
	(person-needs person10 medicine)
	(person-needs person11 medicine)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 medicine)
	(person-has person3 medicine)
	(person-has person4 medicine)
	(person-has person5 medicine)
	(person-has person6 medicine)
	(person-has person7 food)
	(person-has person7 medicine)
	(person-has person8 medicine)
	(person-has person9 medicine)
	(person-has person10 medicine)
	(person-has person11 medicine)
	))
)

; plan
1. (grab-arm1 drone1 crate1 depot)
   deleted: (arm1-free drone1) (at crate1 depot)
   added: (arm1-load drone1 crate1)
   goals met: 1 of 12
2. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 1 of 12
3. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 0 of 12
4. (deliver-arm1 drone1 person7 crate1 food loc1)
   deleted: (arm1-load drone1 crate1) (person-needs person7 food)
   added: (arm1-free drone1) (person-has person7 food)
   goals met: 1 of 12
5. (move-drone drone1 loc1 loc6)
   deleted: (at drone1 loc1)
   added: (at drone1 loc6)
   goals met: 1 of 12
6. (deliver-arm2 drone1 person3 crate3 medicine loc6)
   deleted: (arm2-load drone1 crate3) (person-needs person3 medicine)
   added: (arm2-free drone1) (person-has person3 medicine)
   goals met: 2 of 12
7. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 3 of 12
8. (grab-arm1 drone1 crate11 depot)
   deleted: (arm1-free drone1) (at crate11 depot)
   added: (arm1-load drone1 crate11)
   goals met: 3 of 12
9. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 3 of 12
10. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 2 of 12
11. (deliver-arm1 drone1 person4 crate11 medicine loc7)
   deleted: (arm1-load drone1 crate11) (person-needs person4 medicine)
   added: (arm1-free drone1) (person-has person4 medicine)
   goals met: 3 of 12
12. (move-drone drone1 loc7 loc10)
   deleted: (at drone1 loc7)
   added: (at drone1 loc10)
   goals met: 3 of 12
13. (deliver-arm2 drone1 person5 crate4 medicine loc10)
   deleted: (arm2-load drone1 crate4) (person-needs person5 medicine)
   added: (arm2-free drone1) (person-has person5 medicine)
   goals met: 4 of 12
14. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 5 of 12
15. (grab-arm1 drone1 crate7 depot)
   deleted: (arm1-free drone1) (at crate7 depot)
   added: (arm1-load drone1 crate7)
   goals met: 5 of 12
16. (grab-arm2 drone1 crate10 depot)
   deleted: (arm2-free drone1) (at crate10 depot)
   added: (arm2-load drone1 crate10)
   goals met: 5 of 12
17. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 4 of 12
18. (deliver-arm1 drone1 person6 crate7 medicine loc9)
   deleted: (arm1-load drone1 crate7) (person-needs person6 medicine)
   added: (arm1-free drone1) (person-has person6 medicine)
   goals met: 5 of 12
19. (move-drone drone1 loc9 loc7)
   deleted: (at drone1 loc9)
   added: (at drone1 loc7)
   goals met: 5 of 12
20. (deliver-arm2 drone1 person1 crate10 medicine loc7)
   deleted: (arm2-load drone1 crate10) (person-needs person1 medicine)
   added: (arm2-free drone1) (person-has person1 medicine)
   goals met: 6 of 12
21. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 7 of 12
22. (grab-arm2 drone1 crate8 depot)
   deleted: (arm2-free drone1) (at crate8 depot)
   added: (arm2-load drone1 crate8)
   goals met: 7 of 12
23. (grab-arm1 drone1 crate6 depot)
   deleted: (arm1-free drone1) (at crate6 depot)
   added: (arm1-load drone1 crate6)
   goals met: 7 of 12
24. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 6 of 12
25. (deliver-arm2 drone1 person7 crate8 medicine loc1)
   deleted: (arm2-load drone1 crate8) (person-needs person7 medicine)
   added: (arm2-free drone1) (person-has person7 medicine)
   goals met: 7 of 12
26. (move-drone drone1 loc1 loc2)
   deleted: (at drone1 loc1)
   added: (at drone1 loc2)
   goals met: 7 of 12
27. (move-drone drone1 loc2 loc5)
   deleted: (at drone1 loc2)
   added: (at drone1 loc5)
   goals met: 7 of 12
28. (deliver-arm1 drone1 person8 crate6 medicine loc5)
   deleted: (arm1-load drone1 crate6) (person-needs person8 medicine)
   added: (arm1-free drone1) (person-has person8 medicine)
   goals met: 8 of 12
29. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 9 of 12
30. (grab-arm1 drone1 crate5 depot)
   deleted: (arm1-free drone1) (at crate5 depot)
   added: (arm1-load drone1 crate5)
   goals met: 9 of 12
31. (grab-arm2 drone1 crate9 depot)
   deleted: (arm2-free drone1) (at crate9 depot)
   added: (arm2-load drone1 crate9)
   goals met: 9 of 12
32. (move-drone drone1 depot loc2)
   deleted: (at drone1 depot)
   added: (at drone1 loc2)
   goals met: 8 of 12
33. (deliver-arm1 drone1 person9 crate5 medicine loc2)
   deleted: (arm1-load drone1 crate5) (person-needs person9 medicine)
   added: (arm1-free drone1) (person-has person9 medicine)
   goals met: 9 of 12
34. (move-drone drone1 loc2 loc8)
   deleted: (at drone1 loc2)
   added: (at drone1 loc8)
   goals met: 9 of 12
35. (deliver-arm2 drone1 person10 crate9 medicine loc8)
   deleted: (arm2-load drone1 crate9) (person-needs person10 medicine)
   added: (arm2-free drone1) (person-has person10 medicine)
   goals met: 10 of 12
36. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 11 of 12
37. (grab-arm1 drone1 crate2 depot)
   deleted: (arm1-free drone1) (at crate2 depot)
   added: (arm1-load drone1 crate2)
   goals met: 11 of 12
38. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 10 of 12
39. (deliver-arm1 drone1 person11 crate2 medicine loc10)
   deleted: (arm1-load drone1 crate2) (person-needs person11 medicine)
   added: (arm1-free drone1) (person-has person11 medicine)
   goals met: 11 of 12
40. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 12 of 12
